---
kind: property
id: P:Autodesk.Revit.DB.Lighting.PresetInitialColor.Preset
source: html/877e5e82-b794-2998-4228-bc10f1e464bc.htm
---
# Autodesk.Revit.DB.Lighting.PresetInitialColor.Preset Property

The preset value

## Syntax (C#)
```csharp
public ColorPreset Preset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration